using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Threading;

namespace PJ1_LAST_START
{
    public enum Amulet_Kind
    {
        Fury_Fallen,
        Lifeblood_Heart
    }

    class Shop
    {
        private string _Name = "성유물의 재단";
        public Fury_Fallen Fury = new Fury_Fallen();
        public Lifeblood_Heart Heart = new Lifeblood_Heart();
        public void Welcome(bool ISHeart, bool ISFury)
        {

            Heart.Painting[4] = Heart.Paint_Name;
            Fury.Painting[4] = Fury.Paint_Name;
            if (ISHeart.Equals(true) && ISFury.Equals(true))
            {
                int maxLines = Math.Max(Heart.Painting.Length, Fury.Painting.Length);
               for (int i = 0; i < maxLines; i++)
                {
                    if (i >= Fury.Painting.Length)
                    {
                        Console.WriteLine(Heart.Painting[i]);
                    }
                    else
                    {
                        Console.WriteLine(Heart.Painting[i] + "            " + Fury.Painting[i]);
                    }
                }
                print("전사에게 필요한 무구입니다. 사시면 후회하지 않을실 겁니다.");
            }
            else if (ISHeart.Equals(true) && ISFury.Equals(false))
            {
                Painting1(Heart.Painting);
                print("추가적으로 부적을 활성화 시키겠습니까?");
            }
            else if (ISHeart.Equals(false) && ISFury.Equals(true))
            {
                Painting0(Fury.Painting);
                print("추가적으로 부적을 활성화 시키겠습니까?");
            }
            else
            {
                for(int i = 0; i < Fury.Painting.Length; i++)
                {
                    Console.WriteLine(" ");
                }
            }
        }
        static public void Painting0(string[] Paint)
        {
            for (int i = 0; i < Paint.Length; i++)
            {
                Console.WriteLine("                                                                       " + Paint[i]);

            }
        }
        static public void Painting1(string[] Paint)
        {
            for (int i = 0; i < Paint.Length; i++)
            {
                Console.WriteLine("                                 " + Paint[i]);

            }
        }
        private void SpacePaint(string[] menu_space)
        {
            for (int i = 0; i < menu_space[0].Length / 2; i++)
            {
                Console.Write(" ");
            }
        }
        public void SpaceShopaint_Fury()
        {
            SpacePaint(Fury.Painting);
        }
        public bool shop_Fury(Player p)
        {
            if (p.Coin >= Fury.Cost)
            {
                p.Coin -= Fury.Cost;
                p.Inventory[Fury.Name] = Fury;
                print($"{Fury.Name}가 당신의 전투력을 상승시켜줄 것입니다.");
                return false; //상점에 팔렸다는 의미
            }
            else
            {
                print($"이런 지오가 모자라네요. 부적이 활성화되지 못했어요");
                return true; // 상점에 남아 있다는 의미
            }
        }
        public bool shop_Bloo(Player p) 
        {
            if (p.Coin >= Heart.Cost)
            {
                p.Coin -= Heart.Cost;
                p.Inventory[Heart.Name] = Heart;
                print($"{Heart.Name}가 당신을 적으로부터 지켜줄 것입니다.");
                return false;
            }
            else
            {
                print($"이런 지오가 모자라네요. 부적이 활성화되지 못했어요");
                return true;
            }
        }
        public string Name { get { return _Name; } }
        public void print(string mes)
        {
            foreach (var ch in mes)
            {
                Console.Write(ch);
                Thread.Sleep(30);
            }
            Console.WriteLine();
        }
    }

    public class Item
    {
        protected string _Name;
        protected int _Cost;
        protected string[] _Painting;
        protected string _Paint_Name;

        public string Name { get { return _Name; } }
        public int Cost { get { return _Cost; } }
        public string[] Painting { get { return _Painting; } }
        public string Paint_Name { get { return _Paint_Name; } }

        public Action<object> Effect = null; // 플레이어 적용 효과

    }
    public class Fury_Fallen : Item
    {
        public Fury_Fallen()
        {
            Effect = (player) =>
            {
                Player p = player as Player;
                if (p != null)
                {
                    p.Attack_Power += 15;
                    p.SKDamage += 10;
                }
            };
            _Name = "전사자의 분노";
            _Cost = 500;
            _Paint_Name = "                                 <  전사자의 분노 >                                   ";
            _Painting = new string[] {
"                                                                                      ",
"                                                                                      ",
"                                                                                      ",
"                                                                                      ",
"                                                                                      ",
"                                             .    .                                   ",
"                                           .   =*  .                                  ",
"                                             :*%*  .                                  ",
"                                         .-+*#*%-                                     ",
"                            .  .-:  .  :**=--+%*  .    .                              ",
"                              :**+    .#-:-*##%=    :=  .                             ",
"                 .  .--:.     #-:++:. -@--+%%#%%+=+**%: .                             ",
"                 .  +#==*+-  .@-...-+##%%**@@%#+=-::=%.  ::                           ",
"                 .   =+:::++  #%+=-::---*%@@%+==---*@+  *#*   .                       ",
"               .  .=+.*-:::*-.+@%%%%***###@@###*=+%@@@##%-#*-   .++.  .               ",
"              .  :*+#--#:-*#@@%++#@@%#*%@%@@@@%##%@@%+*#@@#=+#= .%=*-  .              ",
"              . .#-:+=:%-+%*+%**#%%%@%#%*+%@@@@#%@%@@#**%**%==%*=*.-%:     .          ",
"             .  =*:::+*%+%+:+%###@@@@%#%=+*%@@@%%@@@@%##%*-+@+-%%...*#+##: .          ",
"         .  .:. +*::-=%%%+::%%#%%@@@%%%+=***%@@@%%@@@@@%%@=-%@=*%:..+#=*-  .          ",
"           +%=++#*::+*%%%-::%%#@*#@@%@*=#%%##@%@@@@@%#@%%@+=*@%%@=:.#%#:  .           ",
"           .=#+-=%+.-*%%%+=-#@#@=-@@@%=#%%%%%@%%@@@%*+%%%%**#%@@%-.+%+*  .            ",
"          .   +*=%%-.:=%%%#=#@%%-:+@@%%%%%%%%@@%@@@#++%@@%##%@@#=-=%#=+  .            ",
"            . .%*#%%=..-*%%##%@*:-+%@#+#%%%%%@%*#@@#*+#@@%%%@%#--+%%*=%. .            ",
"            . :*--+%%*:.:+%%%%%-=##%%++#@%%%%@%**%@%#**%%%%@#+==*%%*==*+  .           ",
"           .  +=-----=-:-:+%%#==###@#+*#@%%%@@#**#@%%#**%%@#++++*+=====%. . .         ",
"           .  #+-*#*+==+##-=%++####@#+**#@@@@%####@%%%%*#%#*###****##=+%:+=           ",
"           .  +#++#########+=*#%%#%@%+*##%@@%####%@@%%%%###%%%%%%%%%*=*%%%- .         ",
"            . .##***###########%%%%@@#+%%%%%%%%#%@@@%%%%%%%%%%%%%%##+#@###  .         ",
"            .  +@%%%@@@%%%####%%%%%@+%%#%%%%%%%%#=%@%%%%%%%%%%%%%%%%%%+=*-            ",
"               +#-#%@@@@@@%%##%%%%%@==%%#%%%%%%%==%@%%%%%%%@@@@@@@%###==#. .          ",
"               **:#%@@@@@@#%%%#%%%%@+=+@#%%%%%@+=*@%%%%%%%%#@@@@%@%##+=%-             ",
"               =*:#%@#%%%@-.+#%%%%%%%*=*%#%%%@+=*@%%%%%%%#=+@%%%#@%##+%+  .           ",
"             . :%-+%@+###%+...:=#%%%%%%#%%%%%@#%@%%%%%%*=--+@%%#*@%#*%*  .            ",
"             .  =#-*@++##%#::::::+%%%@%%@@@@@@@@@@%%#+-----#%%%**%##@*  .             ",
"              .  -##%#:+##%+:--:::=%%%@@%%@@@@@@@%%+------+@%%#+#@%@=  .              ",
"               .  .+@@--*#%%=-=-:::-*%%@@@@@@@@@%%=----===%%%#++%@%:  .               ",
"                 .  =@%=+*#%%=-==-:-=%%%@@@%@@@%%+----==+%%%%*+#@*.  .                ",
"                  .  -%#=+*##%+==+=--+%%@@@@@@%%#---===+%%%%*+#@=  .                  ",
"                   .  .#%==*##%#+==--=%%%@@@@%%%+--==+#%%%#++#%-  .                   ",
"                        =%*+*###%#*===#%%@@@@%%%=-=*%%%%#*+*#+.  .                    ",
"                      .  .=**+*####%##%%%%@@@%%%##%%%%##*##+.  .                      ",
"                            -*##**###%%%%@@@@%%%%%%##**##=.  .                        ",
"                              .=*###@%#####%%%%%@%%##*=:                              ",
"                                  .-+*#%%%@@@@%#*+-:                                  ",
"                                        ......                                        ",
"                                                                                      ",
"                                                                                      ",
"                                                                                      ",
"                                                                                      ",
"                                                                                      "
            };
        }
    }

    public class Lifeblood_Heart : Item
    {
        public Lifeblood_Heart()
        {
            Effect = (player) =>
            {
                Player p = player as Player;
                if (p != null)
                {
                    p.Max_HP += 100;
                    p.HP += 100;
                    if(p.Max_HP < p.HP)
                    {
                        p.HP = p.Max_HP; 
                    }
                }
            };
            _Name = "생명혈 핵";
            _Cost = 500;
            _Paint_Name = "                                                            < 생명혈의 핵 >                            ";
            _Painting = new string[] {
                "                                                                                                       ",
                "                                                                                                       ",
                "                                                                                                       ",
                "                                                                                                       ",
                "                                                                                                       ",
                "                                                                                                       ",
                "                                                                  *-*@                                 ",
                "                                                             ==+*%%%%%%#*=+                            ",
                "                                                           #-.:*#%%%%%%%#=::*                          ",
                "                                                          @@##*#%%@@@@@%####%@                         ",
                "                                                       #%%%#--+#%@@@@@@@%*==*%%%%                      ",
                "                                                    #*==*#%%@%%@@@@@@@@@@@@@@%##*+*#                   ",
                "                                                  %+::-*%@%+=##@@******%@%%###@@#*==+#                 ",
                "                                                @+:::=#@@*..-%%%==#@@%*+#@%#=-+%@@#+==+%               ",
                "                                              =@%++#%#**###%@@@+=#%@@%%*+%@@@%#%#*#%%#*#@@             ",
                "                                           +::-*%%%*-.-#%@@@@@%-*%@@@@@%**@@@@@@%*+=*#%%%*+==#         ",
                "                                          @%=--+*###*#@@@#++%@%*%######%%#@@%##@@@%#####*+++*@         ",
                "                                          @@@@%%@@@@@@%*-:-##%@*=+#%%%###%@%%#++*%@@@@@@@%@@@@         ",
                "                                         *+-=++*#%%%%#=:-+%@%@#-=#%%@%%#*#@@@@%*++#%%%%%%##*++#        ",
                "                                        *-:::---=*%%#*+*%%@@@@#-=#%%@%%#**@@@@@@%###%%%#***++++*       ",
                "                                       %#--=+*#%%%%##%%@%*+##%%+#@@@@@@%#%@%%##%@@%%%%%%%%##*+++@      ",
                "                                      #%@%%%%@@@@@@@@@#+--+**#%@@##*###%@@%###**##%@@@@@@@@@%%%%@%#    ",
                "                                     #:-#%@@@@@@@@%*=-:-=*****#%#**###**%%#*++*#***##%@@@@@@@@@%*=+@   ",
                "                                     @+::-*#%%#*=-:::-+#@@*=--+#%=-=+==*%*==+*%@%%#*+++**#%%%#*=-=#    ",
                "                                      =#*+*##*-:--+*%@@@@@@%##*#%%#+=+%@@%%@@@@@@@@@%#*+++*###**#%     ",
                "                                       @@%%%%%%%%%%@@@@%@@%==+*#%%@@@@@%%#++=*@@%%@@@@%%%%%%%%%@@      ",
                "                                       @@%@@@@@@@@@@@%++@%-.-=+*##%%%%%###+=-:*@%*#@@@@@@@@@@@@%@      ",
                "                                       @#%%@@@@@@%%@%+-*@#..-=+##%%%%%%%#*+=-:=@@++%@@@@@@@@@@%#%#     ",
                "                                       %+#%@%%####%@*--#@+..-=*#%%%%%%%%##+=-:-%@*=*%@%%%%%%@@%**%     ",
                "                                       #=#%@+-=+#%@%+-=#@=..=*#%@%%##%@@@%#+-::#@*=+%@@%%###%@%++@     ",
                "                                       *=*@%-=*%@@@#--=*@+-+%@#=:.....::=+#%#+-#@*==*@@@@@%#%@#+=@     ",
                "                                       *=+@%+%@##%%+-==+@%%%#=..:=+++++=--:-+%%%%*==+#@%#%%@@@#==%     ",
                "                                       #=+%@@%++%@*-=*==%@*=::=*%%%%%%%%%*+-:-#@%==+=+%@%##%@@#=+*     ",
                "                                       %==%@@++%@*-=**=-*%=:-=+*%%%%%%%%#*+=::*@*-=#+=+%@%##%@*=*      ",
                "                                       @*=*@@+#@*==*##+--#*::-+*#%%%%%%%#*+-:-%%-:+%#+=+%@%%@%+=%=     ",
                "                                      %%%=*%@%%+=+##%%*-:=%=::=+*%%%%%%#*+=::*%+:-#%%%*++#@@@#+*%#     ",
                "                                      +=%**#@#=-+#%@@@%=-:=#---+#%@@@@@%*+--+%*::+@@@%%*==*%%#+%#-#    ",
                "                                      =-*%%*=-=*#%@@@@@+=-:=#+*%%#===++#%%*#%#-:-#@@@@@%#+=-+#%#--#    ",
                "                                      #-----=+#%@@%#%@@*=+-:=%@#=::-==--=%@%*::-=%@@@%%@%%#=-::::+     ",
                "                                       #*++#%%@@@#*%%%%*=+*-:-##*+++++++*%%+::=+=%%%@%#%@@%%%*=+#      ",
                "                                          @@@%##@#%@**%+=*%*-:-*%%****#%%%=:-##+=#%#%@%@%#%@@@         ",
                "                                           @#++*%@@%*%#=+#@%#=::=*#%%@@@#-:=%@%*=+@%#%@@#+=+%          ",
                "                                            @*==+*%%@%++*%@%@#+-:::#@@%+--+%@%@%++#@@%%*=--%@          ",
                "                                            %%#+=+*%%*+*%@%#%@#=+=+%@#*+=+@@%%@@#*+#@%*--+%%#          ",
                "                                            *+#%%%%#++*%@@#%@@@++*#@@%#*+#@%@@%@@#*+*%%%%#+==          ",
                "                                             *+++++++*%@@@@@#*%*+#%@@%%*+%%#%@@@@@%*=====-=#           ",
                "                                              %#****#%@%*#%@##%++#@@@@%*+#@%@@%#%@@%*+++*#=            ",
                "                                                %@@@@@%*=++#%@#++%@@@@@#+*@@%#***#@@@@@@               ",
                "                                                       @#**%@#++#@%###%%*+*%@%#*%                      ",
                "                                                       -%**#*+*#@@#*##%@%#++#*+*@                      ",
                "                                                        #+=+*#%@%++##*+*@@%#+==*                       ",
                "                                                          #%@*   ++===*    @%%                         ",
                "                                                                   :#                                  ",
                "                                                                                                      ",
                "                                                                                                       ",
                "                                                                                                       ",
                "                                                                                                       ",




            };
        }
    }

}